tutorials/3D_pipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( 0.0 -0.005303300858899106 -0.005303300858899106 )	// 000
	 ( 0.1 -0.005303300858899106 -0.005303300858899106 )	// 001
	 ( 0.1 0.005303300858899106 -0.005303300858899106 )	// 002
	 ( 0.0 0.005303300858899106 -0.005303300858899106 )	// 003
	 ( 0.0 -0.005303300858899106 0.005303300858899106 )	// 004
	 ( 0.1 -0.005303300858899106 0.005303300858899106 )	// 005
	 ( 0.1 0.005303300858899106 0.005303300858899106 )	// 006
	 ( 0.0 0.005303300858899106 0.005303300858899106 )	// 007
	 ( 0.1 0.0070710678118654745 -0.0070710678118654745 )	// 008
	 ( 0.0 0.0070710678118654745 -0.0070710678118654745 )	// 009
	 ( 0.1 0.0070710678118654745 0.0070710678118654745 )	// 010
	 ( 0.0 0.0070710678118654745 0.0070710678118654745 )	// 011
	 ( 0.0 -0.0070710678118654745 -0.0070710678118654745 )	// 012
	 ( 0.1 -0.0070710678118654745 -0.0070710678118654745 )	// 013
	 ( 0.0 -0.0070710678118654745 0.0070710678118654745 )	// 014
	 ( 0.1 -0.0070710678118654745 0.0070710678118654745 )	// 015
	 ( 0.1 0.010606601717798212 -0.010606601717798212 )	// 016
	 ( 0.0 0.010606601717798212 -0.010606601717798212 )	// 017
	 ( 0.1 0.010606601717798212 0.010606601717798212 )	// 018
	 ( 0.0 0.010606601717798212 0.010606601717798212 )	// 019
	 ( 0.0 -0.010606601717798212 -0.010606601717798212 )	// 020
	 ( 0.1 -0.010606601717798212 -0.010606601717798212 )	// 021
	 ( 0.0 -0.010606601717798212 0.010606601717798212 )	// 022
	 ( 0.1 -0.010606601717798212 0.010606601717798212 )	// 023
	 ( 0.1 0.035355339059327376 -0.035355339059327376 )	// 024
	 ( 0.0 0.035355339059327376 -0.035355339059327376 )	// 025
	 ( 0.1 0.035355339059327376 0.035355339059327376 )	// 026
	 ( 0.0 0.035355339059327376 0.035355339059327376 )	// 027
	 ( 0.0 -0.035355339059327376 -0.035355339059327376 )	// 028
	 ( 0.1 -0.035355339059327376 -0.035355339059327376 )	// 029
	 ( 0.0 -0.035355339059327376 0.035355339059327376 )	// 030
	 ( 0.1 -0.035355339059327376 0.035355339059327376 )	// 031
); 

edges 
( 
	arc 0 3
		( 0.0 0.0 -0.006477475644174329 )
	arc 3 7
		( 0.0 0.006477475644174329 0.0 )
	arc 4 7
		( 0.0 0.0 0.006477475644174329 )
	arc 0 4
		( 0.0 -0.006477475644174329 0.0 )
	arc 1 2
		( 0.1 0.0 -0.006477475644174329 )
	arc 2 6
		( 0.1 0.006477475644174329 0.0 )
	arc 5 6
		( 0.1 0.0 0.006477475644174329 )
	arc 1 5
		( 0.1 -0.006477475644174329 0.0 )
	arc 9 11
		( 0.0 0.01 0.0 )
	arc 8 10
		( 0.1 0.01 0.0 )
	arc 12 14
		( 0.0 -0.01 0.0 )
	arc 13 15
		( 0.1 -0.01 0.0 )
	arc 14 11
		( 0.0 0.0 0.01 )
	arc 15 10
		( 0.1 0.0 0.01 )
	arc 12 9
		( 0.0 0.0 -0.01 )
	arc 13 8
		( 0.1 0.0 -0.01 )
	arc 17 19
		( 0.0 0.015 0.0 )
	arc 16 18
		( 0.1 0.015 0.0 )
	arc 20 22
		( 0.0 -0.015 0.0 )
	arc 21 23
		( 0.1 -0.015 0.0 )
	arc 22 19
		( 0.0 0.0 0.015 )
	arc 23 18
		( 0.1 0.0 0.015 )
	arc 20 17
		( 0.0 0.0 -0.015 )
	arc 21 16
		( 0.1 0.0 -0.015 )
	arc 25 27
		( 0.0 0.05 0.0 )
	arc 24 26
		( 0.1 0.05 0.0 )
	arc 28 30
		( 0.0 -0.05 0.0 )
	arc 29 31
		( 0.1 -0.05 0.0 )
	arc 30 27
		( 0.0 0.0 0.05 )
	arc 31 26
		( 0.1 0.0 0.05 )
	arc 28 25
		( 0.0 0.0 -0.05 )
	arc 29 24
		( 0.1 0.0 -0.05 )
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	( 100  11  11)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 3  2  8  9  7  6  10  11)	( 100  4  11)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 12  13  1  0  14  15  5  4)	( 100  4  11)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 4  5  6  7  14  15  10  11)	( 100  11  4)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 12  13  8  9  0  1  2  3)	( 100  11  4)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 9  8  16  17  11  10  18  19)	( 100  5  11)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 20  21  13  12  22  23  15  14)	( 100  5  11)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 14  15  10  11  22  23  18  19)	( 100  11  5)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 20  21  16  17  12  13  8  9)	( 100  11  5)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 17  16  24  25  19  18  26  27)	( 100  35  11)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 28  29  21  20  30  31  23  22)	( 100  35  11)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 22  23  18  19  30  31  26  27)	( 100  11  35)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 28  29  24  25  20  21  16  17)	( 100  11  35)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	walls
	{
		type wall;
		faces
		(
			( 9  17  19  11)
			( 20  12  14  22)
			( 20  17  9  12)
			( 14  11  19  22)
			( 17  25  27  19)
			( 28  20  22  30)
			( 28  25  17  20)
			( 22  19  27  30)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 0  3  7  4)
			( 3  9  11  7)
			( 12  0  4  14)
			( 12  9  3  0)
			( 4  7  11  14)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 1  2  6  5)
			( 2  8  10  6)
			( 13  1  5  15)
			( 13  8  2  1)
			( 5  6  10  15)
			( 8  16  18  10)
			( 21  13  15  23)
			( 21  16  8  13)
			( 15  10  18  23)
			( 16  24  26  18)
			( 29  21  23  31)
			( 29  24  16  21)
			( 23  18  26  31)
		);
	}

	atmosphere
	{
		type patch;
		faces
		(
			( 25  24  26  27)
			( 28  29  31  30)
			( 28  29  24  25)
			( 30  31  26  27)
		);
	}

); 

mergePatchPairs 
( 
); 

